Tekla.Structures.Internal.ConnectionHelper
DO NOT USE! For internal usage only!

Tekla.Structures.Internal.ConnectionHelper.AddPlugin(Tekla.Structures.Internal.StructuresPluginDescriptor)
DO NOT USE! For internal usage only!
structuresPlugin:
Returns:

Tekla.Structures.Internal.ConnectionHelper.SetCurrentPlugin(Tekla.Structures.Internal.ITsInvoker,System.Object)
DO NOT USE! For internal usage only!
Invoker:
currentPlugin:
Returns:

Tekla.Structures.Internal.ConnectionHelper.GetCurrentPlugin
DO NOT USE! For internal usage only!
Returns:

Tekla.Structures.Internal.ConnectionHelper.DefineInput
DO NOT USE! For internal usage only!

Tekla.Structures.Internal.ConnectionHelper.Run
DO NOT USE! For internal usage only!
Returns:

Tekla.Structures.Internal.ConnectionHelper.GetInputFromCore
TODO: This should be refactored, since it's exactly the same as in ModelPluginHelper.
Returns: List of input items for the plugin